class Alnjahapi {

  static Map<String,List<Map<String,dynamic>>> corsess= {
  "courses": [
    {"id":001,
      "courseName": "تطوير تطبيقات باستخدام Flutter",
      "hours": 40,
      "period": "صباحية",
      "startDate": "2024-10-01",
      "courseImage": "https://example.com/flutter_course.jpg",
      "fees": 300,
      "shortDescription": "هذا الكورس يقدم لك فرصة رائعة لتعلم تطوير تطبيقات موبايل عالية الأداء باستخدام Flutter. ستكتسب المهارات اللازمة لبناء تطبيقات قوية وسلسة من خلال واجهات مستخدم متقدمة تناسب جميع أنظمة التشغيل مثل iOS و Android.",
      "longDescription": "الكورس يشمل كافة المهارات التي تحتاجها لتصبح مطور تطبيقات محترف باستخدام Flutter. سوف تبدأ بتعلم لغة البرمجة Dart، ثم تتعمق في تصميم وتطوير واجهات مستخدم متقدمة وجذابة، بالإضافة إلى تطبيقات عملية لتطوير تطبيقات متعددة المنصات. ستتعلم أيضاً كيفية تحسين أداء التطبيقات، وإضافة وظائف تفاعلية مثل التعامل مع قواعد البيانات والتكامل مع واجهات برمجة التطبيقات (APIs). بنهاية الكورس، ستكون قادراً على تطوير تطبيقات موبايل قوية وجذابة يمكن نشرها على جميع المتاجر الإلكترونية."
    },
    {"id":002,
      "courseName": "أساسيات برمجة Dart",
      "hours": 30,
      "period": "مسائية",
      "startDate": "2024-11-15",
      "courseImage": "https://example.com/dart_course.jpg",
      "fees": 200,
      "shortDescription": "هذا الكورس مخصص لمن يريد تعلم الأساسيات القوية للبرمجة باستخدام لغة Dart. ستتعلم مفاهيم البرمجة الأساسية والتي تعتبر اللبنة الأولى لتطوير تطبيقات احترافية في المستقبل.",
      "longDescription": "في هذا الكورس، ستتعرف على الأساسيات التي تحتاجها لتطوير تطبيقات برمجة قوية باستخدام لغة Dart. ستبدأ بتعلم كيفية التعامل مع المتغيرات، الحلقات الشرطية، الوظائف، والمصفوفات. كما ستتعلم كيفية إنشاء هيكل برمجي متكامل وفهم كيفية التحكم في تدفق البيانات في برامجك. بالإضافة إلى ذلك، سيتناول الكورس كيفية العمل مع الكائنات والصفوف (Classes) والتركيب البرمجي المتقدم. بنهاية الكورس، ستتمكن من كتابة برامج Dart فعالة ومهيأة لتطوير تطبيقات حقيقية باستخدام Flutter."
    },
    {"id":003,
      "courseName": "دمج API في تطبيقات الموبايل",
      "hours": 25,
      "period": "صباحية",
      "startDate": "2024-12-01",
      "courseImage": "https://example.com/api_integration_course.jpg",
      "fees": 250,
      "shortDescription": "تعلم كيفية دمج واجهات برمجة التطبيقات (APIs) في تطبيقاتك لتمكينها من التواصل مع خوادم الويب والحصول على بيانات ديناميكية. هذا الكورس يفتح لك المجال لربط تطبيقاتك بمصادر بيانات متعددة.",
      "longDescription": "يغطي هذا الكورس كيفية التكامل مع خدمات الويب عبر واجهات برمجة التطبيقات (APIs) لتطوير تطبيقات موبايل قوية وحديثة. ستتعلم كيفية إرسال واستقبال البيانات عبر الشبكة باستخدام بروتوكولات مثل HTTP، وكيفية التعامل مع استجابات JSON وتحليلها لعرضها في تطبيقاتك. بالإضافة إلى ذلك، ستتعلم كيفية استخدام RESTful APIs لبناء تطبيقات تعتمد على بيانات حقيقية في الوقت الفعلي، وستتمكن من التعامل مع الأخطاء التي قد تحدث أثناء عملية التواصل مع السيرفرات. بنهاية هذا الكورس، ستتمكن من دمج البيانات بسهولة وسلاسة في تطبيقات الموبايل الخاصة بك وتقديم تجربة مستخدم متميزة."
    }
  ]
};
  static Map<String,List<Map<String,dynamic>>> coputerCorsess= {
    "courses": [
      {"id":001,
        "courseName": "تطوير تطبيقات باستخدام Flutter",
        "hours": 40,
        "period": "صباحية",
        "startDate": "2024-10-01",
        "courseImage": "https://example.com/flutter_course.jpg",
        "fees": 300,
        "shortDescription": "هذا الكورس يقدم لك فرصة رائعة لتعلم تطوير تطبيقات موبايل عالية الأداء باستخدام Flutter. ستكتسب المهارات اللازمة لبناء تطبيقات قوية وسلسة من خلال واجهات مستخدم متقدمة تناسب جميع أنظمة التشغيل مثل iOS و Android.",
        "longDescription": "الكورس يشمل كافة المهارات التي تحتاجها لتصبح مطور تطبيقات محترف باستخدام Flutter. سوف تبدأ بتعلم لغة البرمجة Dart، ثم تتعمق في تصميم وتطوير واجهات مستخدم متقدمة وجذابة، بالإضافة إلى تطبيقات عملية لتطوير تطبيقات متعددة المنصات. ستتعلم أيضاً كيفية تحسين أداء التطبيقات، وإضافة وظائف تفاعلية مثل التعامل مع قواعد البيانات والتكامل مع واجهات برمجة التطبيقات (APIs). بنهاية الكورس، ستكون قادراً على تطوير تطبيقات موبايل قوية وجذابة يمكن نشرها على جميع المتاجر الإلكترونية."
      },
      {"id":002,
        "courseName": "أساسيات برمجة Dart",
        "hours": 30,
        "period": "مسائية",
        "startDate": "2024-11-15",
        "courseImage": "https://example.com/dart_course.jpg",
        "fees": 200,
        "shortDescription": "هذا الكورس مخصص لمن يريد تعلم الأساسيات القوية للبرمجة باستخدام لغة Dart. ستتعلم مفاهيم البرمجة الأساسية والتي تعتبر اللبنة الأولى لتطوير تطبيقات احترافية في المستقبل.",
        "longDescription": "في هذا الكورس، ستتعرف على الأساسيات التي تحتاجها لتطوير تطبيقات برمجة قوية باستخدام لغة Dart. ستبدأ بتعلم كيفية التعامل مع المتغيرات، الحلقات الشرطية، الوظائف، والمصفوفات. كما ستتعلم كيفية إنشاء هيكل برمجي متكامل وفهم كيفية التحكم في تدفق البيانات في برامجك. بالإضافة إلى ذلك، سيتناول الكورس كيفية العمل مع الكائنات والصفوف (Classes) والتركيب البرمجي المتقدم. بنهاية الكورس، ستتمكن من كتابة برامج Dart فعالة ومهيأة لتطوير تطبيقات حقيقية باستخدام Flutter."
      },
      {"id":003,
        "courseName": "دمج API في تطبيقات الموبايل",
        "hours": 25,
        "period": "صباحية",
        "startDate": "2024-12-01",
        "courseImage": "https://example.com/api_integration_course.jpg",
        "fees": 250,
        "shortDescription": "تعلم كيفية دمج واجهات برمجة التطبيقات (APIs) في تطبيقاتك لتمكينها من التواصل مع خوادم الويب والحصول على بيانات ديناميكية. هذا الكورس يفتح لك المجال لربط تطبيقاتك بمصادر بيانات متعددة.",
        "longDescription": "يغطي هذا الكورس كيفية التكامل مع خدمات الويب عبر واجهات برمجة التطبيقات (APIs) لتطوير تطبيقات موبايل قوية وحديثة. ستتعلم كيفية إرسال واستقبال البيانات عبر الشبكة باستخدام بروتوكولات مثل HTTP، وكيفية التعامل مع استجابات JSON وتحليلها لعرضها في تطبيقاتك. بالإضافة إلى ذلك، ستتعلم كيفية استخدام RESTful APIs لبناء تطبيقات تعتمد على بيانات حقيقية في الوقت الفعلي، وستتمكن من التعامل مع الأخطاء التي قد تحدث أثناء عملية التواصل مع السيرفرات. بنهاية هذا الكورس، ستتمكن من دمج البيانات بسهولة وسلاسة في تطبيقات الموبايل الخاصة بك وتقديم تجربة مستخدم متميزة."
      }
    ]
  };
  static Map<String,List<Map<String,dynamic>>> englishCorsess= {
    "courses": [
      {"id":001,
        "courseName": "تطوير تطبيقات باستخدام Flutter",
        "hours": 40,
        "period": "صباحية",
        "startDate": "2024-10-01",
        "courseImage": "https://example.com/flutter_course.jpg",
        "fees": 300,
        "shortDescription": "هذا الكورس يقدم لك فرصة رائعة لتعلم تطوير تطبيقات موبايل عالية الأداء باستخدام Flutter. ستكتسب المهارات اللازمة لبناء تطبيقات قوية وسلسة من خلال واجهات مستخدم متقدمة تناسب جميع أنظمة التشغيل مثل iOS و Android.",
        "longDescription": "الكورس يشمل كافة المهارات التي تحتاجها لتصبح مطور تطبيقات محترف باستخدام Flutter. سوف تبدأ بتعلم لغة البرمجة Dart، ثم تتعمق في تصميم وتطوير واجهات مستخدم متقدمة وجذابة، بالإضافة إلى تطبيقات عملية لتطوير تطبيقات متعددة المنصات. ستتعلم أيضاً كيفية تحسين أداء التطبيقات، وإضافة وظائف تفاعلية مثل التعامل مع قواعد البيانات والتكامل مع واجهات برمجة التطبيقات (APIs). بنهاية الكورس، ستكون قادراً على تطوير تطبيقات موبايل قوية وجذابة يمكن نشرها على جميع المتاجر الإلكترونية."
      },
      {"id":002,
        "courseName": "أساسيات برمجة Dart",
        "hours": 30,
        "period": "مسائية",
        "startDate": "2024-11-15",
        "courseImage": "https://example.com/dart_course.jpg",
        "fees": 200,
        "shortDescription": "هذا الكورس مخصص لمن يريد تعلم الأساسيات القوية للبرمجة باستخدام لغة Dart. ستتعلم مفاهيم البرمجة الأساسية والتي تعتبر اللبنة الأولى لتطوير تطبيقات احترافية في المستقبل.",
        "longDescription": "في هذا الكورس، ستتعرف على الأساسيات التي تحتاجها لتطوير تطبيقات برمجة قوية باستخدام لغة Dart. ستبدأ بتعلم كيفية التعامل مع المتغيرات، الحلقات الشرطية، الوظائف، والمصفوفات. كما ستتعلم كيفية إنشاء هيكل برمجي متكامل وفهم كيفية التحكم في تدفق البيانات في برامجك. بالإضافة إلى ذلك، سيتناول الكورس كيفية العمل مع الكائنات والصفوف (Classes) والتركيب البرمجي المتقدم. بنهاية الكورس، ستتمكن من كتابة برامج Dart فعالة ومهيأة لتطوير تطبيقات حقيقية باستخدام Flutter."
      },
      {"id":003,
        "courseName": "دمج API في تطبيقات الموبايل",
        "hours": 25,
        "period": "صباحية",
        "startDate": "2024-12-01",
        "courseImage": "https://example.com/api_integration_course.jpg",
        "fees": 250,
        "shortDescription": "تعلم كيفية دمج واجهات برمجة التطبيقات (APIs) في تطبيقاتك لتمكينها من التواصل مع خوادم الويب والحصول على بيانات ديناميكية. هذا الكورس يفتح لك المجال لربط تطبيقاتك بمصادر بيانات متعددة.",
        "longDescription": "يغطي هذا الكورس كيفية التكامل مع خدمات الويب عبر واجهات برمجة التطبيقات (APIs) لتطوير تطبيقات موبايل قوية وحديثة. ستتعلم كيفية إرسال واستقبال البيانات عبر الشبكة باستخدام بروتوكولات مثل HTTP، وكيفية التعامل مع استجابات JSON وتحليلها لعرضها في تطبيقاتك. بالإضافة إلى ذلك، ستتعلم كيفية استخدام RESTful APIs لبناء تطبيقات تعتمد على بيانات حقيقية في الوقت الفعلي، وستتمكن من التعامل مع الأخطاء التي قد تحدث أثناء عملية التواصل مع السيرفرات. بنهاية هذا الكورس، ستتمكن من دمج البيانات بسهولة وسلاسة في تطبيقات الموبايل الخاصة بك وتقديم تجربة مستخدم متميزة."
      }
    ]
  };

static Map<String,dynamic> profile={
  "userProfile": {
    "userId": 12345,
    "fullNameArabic": "محمد أحمد محمد علي",
    "fullNameEnglish": "Mohemmad Ahemed Mohemmad Ali",
    "email": "ahmed@example.com",
    "phoneNumber": "+967123456789",
    "dateOfBirth": "1990-05-15",
    "profilePicture": "assets/images/profile.jpg",
    "address": {
      "directorate": "شارع التحرير",
      "province": "صنعاء",
      "country": "اليمن",

    },
  
    "AcademicQualification":
      {
        "degree": "بكالوريوس علوم الحاسوب",
        "university": "جامعة صنعاء",
        "startDate": "2012-09-01",
        "endDate": "2016-07-15"
      }

    
     
  }
};

static Map<String,dynamic> user={
  "user": {
    "fullName": "محمد أحمد محمد علي",
    "email": "ahmed@example.com",
    "image": "",
    "password": "password123", 
    "phoneNumber": "+967123456789",
    "address": {
      "street": "شارع التحرير",
      "city": "صنعاء",
      "country": "اليمن",
    }
  }
};


}